using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace lab
{
    /// <summary>
    /// Замечания:
    ///     1.	Во всех задачах данного раздела подразумевается, что исходная информация
    ///         хранится в текстовом файле input.txt, каждая строка которого содержит полную 
    ///         информацию о некотором объекте, результирующая информация должна быть записана 
    ///         в файл output.txt.
    ///     2.	Для хранения данных внутри программы организовать массив структур. 
    ///     3.	В типе структура реализуется метод CompareTo интерфейса IComparable, 
    ///         перегружается метод ToString базового класса object и необходимые операции 
    ///         отношения, поля данных и дополнительные методы продумайте самостоятельно.
    ///        
    /// Задание:
    ///     	На основе данных входного файла составить список сотрудников учреждения, 
    ///     	включив следующие данные: ФИО,  год принятия на работу, должность, зарплата,  
    ///     	рабочий стаж. Вывести в новый файл информацию о сотрудниках, имеющих зарплату ниже 
    ///     	определенного уровня, отсортировав их по рабочему стажу.
    /// </summary>
    class lab16
    {
    }
}
